public/ephemeris/ephemeris.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../autobiography/chronological.html">Chronological</a> &gt;
</p>

<div id="outline-container-orgb483ce4" class="outline-2">
<h2 id="orgb483ce4">Ephemeris</h2>
<div class="outline-text-2" id="text-orgb483ce4">
<p>
Ephemeris (ἐφημερίς) is an ancient greek word meaning diary, journal.
In astronomy, ephemeris refers to a book of tables describing the
trajectory of astronomical objects.
</p>

<p>
I keep a daily diary since 2022 which I update quite regularly.  I
used to write everything on paper, I then switched to Obsidian for one
year, then back to paper again and finally on Emacs org mode. I still
think that nothing beats a physical diary.
</p>

<p>
Here I will keep a sort of <a href="../my-public-diary.html">public diary</a> with various thoughts and
stuff I find interesting for the record. To stay up to date with
new entries, you can subscribe to the <b>RSS</b> <a href="../feeds/feedEphemeris.rss">feed</a>.
</p>

<p>
Get a list of the entries <a href="entries.html">here</a>.
</p>

<hr />

<p>
Travel: <a href="../index.html">Giovanni's Diary</a>, <a href="../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
